backend/app/controllers/gifts_controller.rb

    def index
        gifts =Gift.all
---
SELECT "gifts".* FROM "gifts"